Repository: overpolish/keyframeless
Catalog: Mirage/Mirage/Plugin/MirageUI.xcstrings
Source language: en
Languages: de, es, fr, ja, ko, zh_hans

source: The dot product of two vectors.
de: Das Skalarprodukt zweier Vektoren.
es: El producto escalar de dos vectores.
fr: Le produit scalaire de deux vecteurs.
ja: 2つのベクトルの内積。
ko: 두 벡터의 내적입니다.
zh_hans: 两个向量的点积。

source: The drag position, 0 to 1 across the frame.
de: Die Ziehposition, 0 bis 1 über das Bild.
es: La posición de arrastre, de 0 a 1 en el fotograma.
fr: La position du glissement, de 0 à 1 sur l'image.
ja: ドラッグ位置。フレーム全体で 0〜1。
ko: 드래그 위치로, 프레임 전체에서 0에서 1까지.
zh_hans: 拖动位置，在画面上从 0 到 1。

source: The drag position, same as mouse.
de: Die Ziehposition, wie mouse.
es: La posición de arrastre, igual que mouse.
fr: La position du glissement, identique à mouse.
ja: ドラッグ位置。mouse と同じ。
ko: 드래그 위치로, mouse 와 동일합니다.
zh_hans: 拖动位置，与 mouse 相同。

source: The dragged radius in fromR, in min-side fractions.
de: Der gezogene Radius in fromR, in Anteilen der kurzen Seite.
es: El radio arrastrado en fromR, en fracciones del lado menor.
fr: Le rayon déplacé dans fromR, en fractions du petit côté.
ja: fromR で使うドラッグ中の半径。短辺に対する割合。
ko: fromR에서 쓰는 드래그 중인 반지름입니다. 짧은 변 대비 비율입니다.
zh_hans: fromR 中拖动的半径，以短边比例表示。

source: The dragged rectangle in fromRect. Read .min, .max, .width, .height.
de: Das gezogene Rechteck in fromRect. Lies .min, .max, .width, .height.
es: El rectángulo arrastrado en fromRect. Lee .min, .max, .width, .height.
fr: Le rectangle déplacé dans fromRect. Lire .min, .max, .width, .height.
ja: fromRect で使うドラッグ中の矩形。.min、.max、.width、.height を参照。
ko: fromRect에서 쓰는 드래그 중인 사각형입니다. .min, .max, .width, .height로 읽습니다.
zh_hans: fromRect 中拖动的矩形。可读取 .min、.max、.width、.height。

source: The entry point. Write the pixel colour to fragColor.
de: Der Einstiegspunkt. Schreibe die Pixelfarbe in fragColor.
es: El punto de entrada. Escribe el color del píxel en fragColor.
fr: Le point d'entrée. Écrivez la couleur du pixel dans fragColor.
ja: エントリーポイント。ピクセルの色を fragColor に書き込みます。
ko: 진입점입니다. 픽셀 색상을 fragColor 에 씁니다.
zh_hans: 入口点。将像素颜色写入 fragColor。

source: The frame size in pixels, xy.
de: Die Bildgröße in Pixeln, xy.
es: El tamaño del fotograma en píxeles, xy.
fr: La taille de l'image en pixels, xy.
ja: フレームのサイズ（ピクセル単位、xy）。
ko: 프레임 크기(픽셀 단위, xy)입니다.
zh_hans: 画面尺寸，以像素为单位，xy。

source: The frame size.
de: Die Bildgröße.
es: El tamaño del fotograma.
fr: La taille de l'image.
ja: フレームのサイズ。
ko: 프레임 크기입니다.
zh_hans: 画面尺寸。

source: The full position control with a motion path. Needs a point value. toPos and fromPos warp where it sits.
de: Die vollständige Positionssteuerung mit Bewegungspfad. Braucht einen Punktwert. toPos und fromPos verschieben, wo sie sitzt.
es: El control de posición completo con trayectoria de movimiento. Necesita un valor de punto. toPos y fromPos transforman dónde se sitúa.
fr: Le contrôle de position complet avec trajectoire de mouvement. Nécessite une valeur de point. toPos et fromPos transforment sa position.
ja: モーションパス付きの完全な位置コントロール。ポイント値が必要。toPos と fromPos で表示位置を変換。
ko: 모션 패스가 있는 완전한 위치 컨트롤입니다. 포인트 값이 필요합니다. toPos와 fromPos로 표시 위치를 변환합니다.
zh_hans: 带运动路径的完整位置控件。需要点值。toPos 和 fromPos 变换其位置。

source: The full position control with an editable motion path.
de: Die vollständige Positionssteuerung mit bearbeitbarem Bewegungspfad.
es: El control de posición completo con trayectoria de movimiento editable.
fr: Le contrôle de position complet avec trajectoire de mouvement modifiable.
ja: 編集可能なモーションパス付きの完全な位置コントロール。
ko: 편집 가능한 모션 패스가 있는 완전한 위치 컨트롤입니다.
zh_hans: 带可编辑运动路径的完整位置控件。

source: The handle shape: point.
de: Die Griffform: Punkt.
es: La forma del controlador: punto.
fr: La forme de la poignée : point.
ja: ハンドルの形状: 点。
ko: 핸들 모양: 점.
zh_hans: 控制柄形状：点。

source: The larger of two values.
de: Der größere von zwei Werten.
es: El mayor de dos valores.
fr: La plus grande de deux valeurs.
ja: 2つの値のうち大きい方。
ko: 두 값 중 큰 쪽입니다.
zh_hans: 两个值中较大的一个。

source: The length of a vector.
de: Die Länge eines Vektors.
es: La longitud de un vector.
fr: La longueur d'un vecteur.
ja: ベクトルの長さ。
ko: 벡터의 길이입니다.
zh_hans: 向量的长度。

source: The name shown in the inspector.
de: Der im Inspektor angezeigte Name.
es: El nombre que se muestra en el inspector.
fr: Le nom affiché dans l'inspecteur.
ja: インスペクタに表示される名前。
ko: 인스펙터에 표시되는 이름입니다.
zh_hans: 在检查器中显示的名称。

source: The output colour for this pixel, rgba.
de: Die Ausgabefarbe für dieses Pixel, rgba.
es: El color de salida de este píxel, rgba.
fr: La couleur de sortie de ce pixel, rgba.
ja: このピクセルの出力色、rgba。
ko: 이 픽셀의 출력 색상, rgba.
zh_hans: 该像素的输出颜色，rgba。

source: The part after the decimal point, 0 to 1.
de: Der Teil nach dem Komma, 0 bis 1.
es: La parte tras la coma decimal, de 0 a 1.
fr: La partie après la virgule, de 0 à 1.
ja: 小数点以下の部分、0〜1。
ko: 소수점 이하 부분, 0에서 1까지.
zh_hans: 小数点后的部分，0 到 1。

source: The pixel size of each input image.
de: Die Pixelgröße jedes Eingabebilds.
es: El tamaño en píxeles de cada imagen de entrada.
fr: La taille en pixels de chaque image d'entrée.
ja: 各入力画像のピクセルサイズ。
ko: 각 입력 이미지의 픽셀 크기입니다.
zh_hans: 每个输入图像的像素尺寸。

source: The remainder, wrapping into 0 to b.
de: Der Rest, umgebrochen auf 0 bis b.
es: El resto, ajustado al rango 0 a b.
fr: Le reste, ramené entre 0 et b.
ja: 剰余。0〜b の範囲に折り返します。
ko: 나머지로, 0에서 b 범위로 감쌉니다.
zh_hans: 余数，回绕到 0 到 b。

source: The ring size for a 0 to 1 value, on the shared curve.
de: Die Ringgröße für einen Wert von 0 bis 1, auf der gemeinsamen Kurve.
es: El tamaño del anillo para un valor de 0 a 1, en la curva compartida.
fr: La taille de l'anneau pour une valeur de 0 à 1, sur la courbe partagée.
ja: 0〜1の値に対するリングサイズ。共通カーブ上。
ko: 0에서 1 값에 대한 링 크기입니다. 공유 곡선 기준입니다.
zh_hans: 0 到 1 值对应的圆环大小，基于共享曲线。

source: The smaller of two values.
de: Der kleinere von zwei Werten.
es: El menor de dos valores.
fr: La plus petite de deux valeurs.
ja: 2つの値のうち小さい方。
ko: 두 값 중 작은 쪽입니다.
zh_hans: 两个值中较小的一个。

source: The source clip image. Sample it to read the footage.
de: Das Bild des Quellclips. Taste es ab, um das Material zu lesen.
es: La imagen del clip de origen. Muestréala para leer el metraje.
fr: L'image du plan source. Échantillonnez-la pour lire les rushes.
ja: 元クリップの画像。サンプリングして映像を読み取ります。
ko: 소스 클립 이미지입니다. 샘플링하여 영상을 읽습니다.
zh_hans: 源片段图像。对其采样以读取素材。

source: The sub-part being dragged.
de: Der gerade gezogene Teilbereich.
es: La subparte que se está arrastrando.
fr: La sous-partie en cours de glissement.
ja: ドラッグ中のサブ部分。
ko: 드래그 중인 하위 부분입니다.
zh_hans: 正在拖动的子部件。

source: The top-left corner.
de: Die obere linke Ecke.
es: La esquina superior izquierda.
fr: Le coin supérieur gauche.
ja: 左上の角。
ko: 왼쪽 위 모서리입니다.
zh_hans: 左上角。

source: The top-right corner.
de: Die obere rechte Ecke.
es: La esquina superior derecha.
fr: Le coin supérieur droit.
ja: 右上の角。
ko: 오른쪽 위 모서리입니다.
zh_hans: 右上角。

source: The value this control edits.
de: Der Wert, den dieses Steuerelement bearbeitet.
es: El valor que edita este control.
fr: La valeur que ce contrôle modifie.
ja: このコントロールが編集する値。
ko: 이 컨트롤이 편집하는 값입니다.
zh_hans: 此控件编辑的值。

source: The value this handle edits.
de: Der Wert, den dieser Griff bearbeitet.
es: El valor que edita este controlador.
fr: La valeur que modifie cette poignée.
ja: このハンドルが編集する値。
ko: 이 핸들이 편집하는 값입니다.
zh_hans: 此控制柄编辑的值。

source: This chain is rendering slower than real time.
de: Diese Kette wird langsamer als in Echtzeit gerendert.
es: Esta cadena se renderiza más lento que en tiempo real.
fr: Cette chaîne est rendue plus lentement que le temps réel.
ja: このチェーンのレンダリングはリアルタイムより遅くなっています。
ko: 이 체인은 실시간보다 느리게 렌더링되고 있습니다.
zh_hans: 此链的渲染速度慢于实时。

source: This pixel's position, in pixels.
de: Die Position dieses Pixels, in Pixeln.
es: La posición de este píxel, en píxeles.
fr: La position de ce pixel, en pixels.
ja: このピクセルの位置（ピクセル単位）。
ko: 이 픽셀의 위치(픽셀 단위)입니다.
zh_hans: 该像素的位置，以像素为单位。

source: Three numbers, xyz or rgb.
de: Drei Zahlen, xyz oder rgb.
es: Tres números, xyz o rgb.
fr: Trois nombres, xyz ou rgb.
ja: 3つの数値（xyz または rgb）。
ko: 세 숫자(xyz 또는 rgb)입니다.
zh_hans: 三个数字，xyz 或 rgb。

source: Time in seconds since the clip started.
de: Zeit in Sekunden seit dem Start des Clips.
es: Tiempo en segundos desde que comenzó el clip.
fr: Temps en secondes depuis le début du plan.
ja: クリップ開始からの経過秒数。
ko: 클립이 시작된 이후의 시간(초)입니다.
zh_hans: 自片段开始以来的秒数。

source: Too many controls: %d is the limit
de: Zu viele Steuerungen: %d ist das Maximum
es: Demasiados controles: el máximo es %d
fr: Trop de contrôles : %d au maximum
ja: コントロールが多すぎます。上限は %d です
ko: 컨트롤이 너무 많습니다. 최대 %d개입니다
zh_hans: 控件过多：上限为 %d 个

source: Transition
de: Übergang
es: Transición
ja: トランジション
ko: 트랜지션
zh_hans: 转场

source: True or false.
de: Wahr oder falsch.
es: Verdadero o falso.
fr: Vrai ou faux.
ja: 真か偽。
ko: 참 또는 거짓입니다.
zh_hans: 真或假。

source: Turns a box drag back into a value.
de: Wandelt ein Ziehen des Rechtecks zurück in einen Wert.
es: Convierte un arrastre de la caja de nuevo en un valor.
fr: Reconvertit un glissement de cadre en valeur.
ja: ボックスのドラッグを値に戻します。
ko: 상자 드래그를 값으로 되돌립니다.
zh_hans: 将框的拖动转换回值。

source: Turns a drag back into a value. Optional, guessed if omitted.
de: Wandelt ein Ziehen zurück in einen Wert. Optional, wird bei Auslassung geschätzt.
es: Convierte un arrastre de nuevo en un valor. Opcional; se deduce si se omite.
fr: Reconvertit un glissement en valeur. Facultatif, déduit si omis.
ja: ドラッグを値に戻します。省略可能で、省略時は推定されます。
ko: 드래그를 값으로 되돌립니다. 선택 사항이며 생략하면 추정합니다.
zh_hans: 将拖动转换回值。可选，省略时会自动推断。

source: Turns a dragged radius r back into a value.
de: Wandelt einen gezogenen Radius r zurück in einen Wert.
es: Convierte un radio arrastrado r de nuevo en un valor.
fr: Retransforme un rayon r déplacé en valeur.
ja: ドラッグした半径 r を値に戻す。
ko: 드래그한 반지름 r을 값으로 되돌립니다.
zh_hans: 将拖动的半径 r 转换回值。

source: Turns a ring size back into a 0 to 1 value.
de: Wandelt eine Ringgröße zurück in einen Wert von 0 bis 1.
es: Convierte un tamaño de anillo de nuevo en un valor de 0 a 1.
fr: Retransforme une taille d'anneau en valeur de 0 à 1.
ja: リングサイズを0〜1の値に戻す。
ko: 링 크기를 0에서 1 값으로 되돌립니다.
zh_hans: 将圆环大小转换回 0 到 1 的值。

source: Turns the dragged rect back into a value.
de: Wandelt das gezogene Rechteck zurück in einen Wert.
es: Convierte el rectángulo arrastrado de nuevo en un valor.
fr: Retransforme le rectangle déplacé en valeur.
ja: ドラッグした矩形を値に戻す。
ko: 드래그한 사각형을 값으로 되돌립니다.
zh_hans: 将拖动的矩形转换回值。

source: Up-down resize.
de: Größe ändern oben-unten.
es: Redimensionar arriba-abajo.
fr: Redimensionnement haut-bas.
ja: 上下のサイズ変更。
ko: 상하 크기 조절입니다.
zh_hans: 上下调整大小。

source: Wavy distortion
de: Wellenverzerrung
es: Distorsión ondulada
fr: Distorsion ondulée
ja: 波状ディストーション
ko: 물결 왜곡
zh_hans: 波浪扭曲

source: Where a box handle sits, from the value.
de: Wo ein Rechteck-Griff sitzt, aus dem Wert.
es: Dónde se sitúa un controlador de caja, a partir del valor.
fr: Où se place une poignée de cadre, à partir de la valeur.
ja: ボックスハンドルの位置。値から求めます。
ko: 상자 핸들의 위치로, 값에서 구합니다.
zh_hans: 框控制柄的位置，由值得出。

source: Where a ring or box sits in the frame, 0 to 1.
de: Wo ein Ring oder Rechteck im Bild sitzt, 0 bis 1.
es: Dónde se sitúa un anillo o caja en el fotograma, de 0 a 1.
fr: Où se place un anneau ou un cadre dans l'image, de 0 à 1.
ja: リングやボックスがフレーム内のどこに置かれるか、0〜1。
ko: 링이나 상자가 프레임에서 놓이는 위치, 0에서 1까지.
zh_hans: 环或框在画面中的位置，0 到 1。

source: Where a ring or rotate sits. A point value follows it live.
de: Wo ein Ring oder Rotate sitzt. Ein Punktwert folgt live.
es: Dónde se sitúa un anillo o rotate. Un valor de punto lo sigue en vivo.
fr: Où se place un anneau ou un rotate. Une valeur de point le suit en direct.
ja: リングやローテートの位置。ポイント値を指定するとライブで追従。
ko: 링이나 회전 컨트롤의 위치입니다. 포인트 값을 지정하면 실시간으로 따라갑니다.
zh_hans: 圆环或旋转控件的位置。指定点值时会实时跟随。

source: Where the handle sits, worked out from the value.
de: Wo der Griff sitzt, berechnet aus dem Wert.
es: Dónde se sitúa el controlador, calculado a partir del valor.
fr: Où se place la poignée, calculé à partir de la valeur.
ja: ハンドルの位置。値から計算されます。
ko: 핸들의 위치로, 값에서 계산됩니다.
zh_hans: 控制柄的位置，由值计算得出。

source: Which axes a rotate control spins: x, y, z.
de: Um welche Achsen sich ein Rotations-Steuerelement dreht: x, y, z.
es: Qué ejes gira un control de rotación: x, y, z.
fr: Autour de quels axes tourne une commande de rotation : x, y, z.
ja: 回転コントロールが回す軸: x, y, z。
ko: 회전 컨트롤이 도는 축: x, y, z.
zh_hans: 旋转控件绕哪些轴旋转：x、y、z。

source: Write a shader for a colourful flowing plasma background.
de: Schreibe einen Mirage für einen farbenfrohen, fließenden Plasma-Hintergrund.
es: Escribe un shader para un fondo de plasma fluido y colorido.
fr: Écris un shader pour un arrière-plan plasma coloré et fluide.
ja: カラフルで流れるようなプラズマ背景のシェーダーを書いて。
ko: 다채롭고 흐르는 듯한 플라즈마 배경 셰이더를 작성해 줘.
zh_hans: 编写一个呈现绚丽流动等离子背景的着色器。

source: Write a shader that distorts the clip with a wavy ripple.
de: Schreibe einen Mirage, der den Clip mit einer welligen Kräuselung verzerrt.
es: Escribe un shader que distorsione el clip con una ondulación.
fr: Écris un shader qui déforme le plan avec une ondulation.
ja: 波状のリップルでクリップを歪ませるシェーダーを書いて。
ko: 물결치는 리플로 클립을 왜곡하는 셰이더를 작성해 줘.
zh_hans: 编写一个用波浪涟漪扭曲片段的着色器。

source: Writing a shader
de: Einen Mirage schreiben
es: Escribir un shader
fr: Écrire un shader
ja: シェーダを書く
ko: 셰이더 작성
zh_hans: 编写着色器

source: `#%@` can't set a group: audio and gradients have their own
de: `#%@` kann keine Gruppe setzen: Audio und Verläufe haben ihre eigene
es: `#%@` no puede definir un grupo: el audio y los degradados tienen el suyo
fr: `#%@` ne peut pas définir de groupe : l'audio et les dégradés ont le leur
ja: `#%@` はグループを指定できません。オーディオとグラデーションには専用のグループがあります
ko: `#%@`은(는) 그룹을 설정할 수 없습니다. 오디오와 그라디언트에는 전용 그룹이 있습니다
zh_hans: `#%@` 无法设置分组：音频和渐变有各自的分组

source: `#bool` default=%@ isn't on or off - write true/false, yes/no, on/off, or 1/0
de: `#bool` default=%@ ist weder an noch aus – schreibe true/false, yes/no, on/off oder 1/0
es: `#bool` default=%@ no es ni activado ni desactivado: escribe true/false, yes/no, on/off o 1/0
fr: `#bool` default=%@ n'est ni activé ni désactivé : écrivez true/false, yes/no, on/off ou 1/0
ja: `#bool` の default=%@ はオンでもオフでもありません。true/false、yes/no、on/off、1/0 のいずれかで書いてください
ko: `#bool`의 default=%@는 켜짐도 꺼짐도 아닙니다. true/false, yes/no, on/off 또는 1/0으로 작성하세요
zh_hans: `#bool` 的 default=%@ 既不是开也不是关，请写 true/false、yes/no、on/off 或 1/0

source: `#multi` takes at most 4 fields - split it into two controls
de: `#multi` erlaubt höchstens 4 Felder – teile es in zwei Steuerungen auf
es: `#multi` admite 4 campos como máximo: divídelo en dos controles
fr: `#multi` accepte 4 champs au maximum : divisez-le en deux contrôles
ja: `#multi` のフィールドは最大 4 つです。2 つのコントロールに分けてください
ko: `#multi`는 필드를 최대 4개까지 사용할 수 있습니다. 두 개의 컨트롤로 나누세요
zh_hans: `#multi` 最多支持 4 个字段，请拆分为两个控件

source: a to the power b.
de: a hoch b.
es: a elevado a b.
fr: a à la puissance b.
ja: a の b 乗。
ko: a 의 b 제곱입니다.
zh_hans: a 的 b 次方。

source: e to the power x.
de: e hoch x.
es: e elevado a x.
fr: e à la puissance x.
ja: e の x 乗。
ko: e 의 x 제곱입니다.
zh_hans: e 的 x 次方。

source: none makes a box's interior inert (no body-move).
de: none macht das Innere der Box inaktiv (kein Verschieben).
es: none hace inerte el interior de la caja (sin mover el cuerpo).
fr: none rend l'intérieur de la boîte inerte (pas de déplacement).
ja: none でボックス内部を不活性に（本体移動なし）。
ko: none은 상자 내부를 비활성으로 만듭니다(본체 이동 없음).
zh_hans: none 使方框内部不响应拖动（无整体移动）。

source: true keeps a two-field ring or box in proportion. Shift inverts it.
de: true hält einen Ring oder eine Box mit zwei Feldern im Verhältnis. Umschalttaste kehrt es um.
es: true mantiene la proporción de un anillo o caja de dos campos. Mayús lo invierte.
fr: true garde un anneau ou une boîte à deux champs en proportion. Maj l'inverse.
ja: true で2フィールドのリングやボックスの比率を保つ。Shiftで反転。
ko: true는 두 필드 링이나 상자의 비율을 유지합니다. Shift 키로 반전됩니다.
zh_hans: true 使双字段圆环或方框保持比例。Shift 键反转。

source: Hue
de: Farbton
es: Tono
fr: Teinte
ja: 色相
ko: 색상
zh_hans: 色相

source: Light
de: Licht
es: Luz
fr: Lumière
ja: 明るさ
ko: 밝기
zh_hans: 亮度

source: Surface
de: Fläche
es: Superficie
ja: サーフェス
ko: 서피스
zh_hans: 表面

source: Use exactly one `#frames` directive in the Image shader
de: Verwende genau eine `#frames`-Direktive im Image-Shader
es: Usa exactamente una directiva `#frames` en el shader Image
fr: N’utilisez qu’une seule directive `#frames` dans le shader Image
ja: Image シェーダーでは `#frames` ディレクティブをちょうど 1 つ使用してください
ko: Image 셰이더에는 `#frames` 지시문을 정확히 하나만 사용하세요
zh_hans: 在 Image 着色器中只能使用一条 `#frames` 指令

source: `#frames` needs offsets="-1,+1", a comma-separated list of whole frames
de: `#frames` benötigt offsets="-1,+1", eine kommagetrennte Liste ganzer Frames
es: `#frames` necesita offsets="-1,+1", una lista de fotogramas enteros separados por comas
fr: `#frames` exige offsets="-1,+1", une liste d’images entières séparées par des virgules
ja: `#frames` には offsets="-1,+1" が必要です。カンマ区切りの整数フレームで指定してください
ko: `#frames`에는 offsets="-1,+1"이 필요합니다. 쉼표로 구분한 정수 프레임 목록을 지정하세요
zh_hans: `#frames` 需要 offsets="-1,+1"，即以逗号分隔的整数帧列表

source: `#frames` offsets must be whole frames, like offsets="-2,-1,+1"
de: `#frames`-Offsets müssen ganze Frames sein, etwa offsets="-2,-1,+1"
es: Los desplazamientos de `#frames` deben ser fotogramas enteros, como offsets="-2,-1,+1"
fr: Les décalages de `#frames` doivent être des images entières, comme offsets="-2,-1,+1"
ja: `#frames` のオフセットは offsets="-2,-1,+1" のような整数フレームで指定してください
ko: `#frames` 오프셋은 offsets="-2,-1,+1"처럼 정수 프레임이어야 합니다
zh_hans: `#frames` 的偏移必须是整数帧，例如 offsets="-2,-1,+1"

source: `#frames` offset 0 is the current frame - read that from iChannel0
de: Der `#frames`-Offset 0 ist der aktuelle Frame – lies ihn über iChannel0
es: El desplazamiento 0 de `#frames` es el fotograma actual: léelo desde iChannel0
fr: Le décalage 0 de `#frames` est l’image actuelle : lisez-la depuis iChannel0
ja: `#frames` のオフセット 0 は現在のフレームです。iChannel0 から読み取ってください
ko: `#frames` 오프셋 0은 현재 프레임입니다. iChannel0에서 읽으세요
zh_hans: `#frames` 偏移 0 就是当前帧，请改从 iChannel0 读取

source: `#frames` lists the same offset twice - each offset binds its own iNeighbor slot
de: `#frames` nennt denselben Offset zweimal – jeder Offset belegt seinen eigenen iNeighbor-Slot
es: `#frames` repite el mismo desplazamiento: cada uno ocupa su propia ranura iNeighbor
fr: `#frames` répète le même décalage : chacun occupe son propre emplacement iNeighbor
ja: `#frames` に同じオフセットが 2 回あります。各オフセットはそれぞれの iNeighbor スロットに割り当てられます
ko: `#frames`에 같은 오프셋이 두 번 있습니다. 각 오프셋은 고유한 iNeighbor 슬롯에 연결됩니다
zh_hans: `#frames` 中同一偏移出现了两次，每个偏移各占一个 iNeighbor 插槽

source: `#frames` takes at most %d offsets - each one is another full frame in memory
de: `#frames` erlaubt höchstens %d Offsets – jeder ist ein weiterer vollständiger Frame im Speicher
es: `#frames` admite como máximo %d desplazamientos: cada uno es otro fotograma completo en memoria
fr: `#frames` accepte au maximum %d décalages : chacun représente une image complète de plus en mémoire
ja: `#frames` のオフセットは最大 %d 個です。1 つにつきフレーム 1 枚分のメモリを消費します
ko: `#frames`는 오프셋을 최대 %d개까지 받습니다. 하나마다 프레임 한 장이 메모리에 더 올라갑니다
zh_hans: `#frames` 最多接受 %d 个偏移，每个偏移都会在内存中多占用一整帧

source: Also deliver the clip at other frames, for trails and other effects that read across time.
de: Liefert den Clip zusätzlich zu anderen Frames – für Spuren und andere Effekte, die über die Zeit lesen.
es: Entrega también el clip en otros fotogramas, para estelas y otros efectos que leen a lo largo del tiempo.
fr: Fournit aussi le plan à d’autres images, pour les traînées et les effets qui lisent dans le temps.
ja: 他のフレームのクリップも受け取ります。時間をまたいで読み取る軌跡などの効果に使います。
ko: 다른 프레임의 클립도 전달합니다. 시간을 가로질러 읽는 잔상 등의 효과에 사용합니다.
zh_hans: 同时提供其他帧的片段，可用于拖尾等需要跨时间读取的效果。

source: #frames: which frames to deliver, signed and relative to this one, like "-2,-1,+1".
de: #frames: welche Frames geliefert werden – vorzeichenbehaftet und relativ zu diesem, etwa "-2,-1,+1".
es: #frames: qué fotogramas entregar, con signo y relativos a este, como "-2,-1,+1".
fr: #frames : quelles images fournir, signées et relatives à celle-ci, comme "-2,-1,+1".
ja: #frames: 受け取るフレーム。このフレームからの符号付き相対値で、例えば "-2,-1,+1" のように指定します。
ko: #frames: 전달할 프레임. 현재 프레임 기준의 부호 있는 상대값이며 예를 들어 "-2,-1,+1"입니다.
zh_hans: #frames：要提供哪些帧，为相对当前帧的带符号数值，例如 "-2,-1,+1"。

source: The source clip at the i-th frame offset declared by #frames, sampled at uv.
de: Der Quellclip beim i-ten von #frames deklarierten Frame-Offset, an uv abgetastet.
es: El clip de origen en el i-ésimo desplazamiento declarado por #frames, muestreado en uv.
fr: Le plan source au i-ème décalage déclaré par #frames, échantillonné en uv.
ja: #frames が宣言した i 番目のフレームオフセットのソースクリップを uv でサンプリングします。
ko: #frames가 선언한 i번째 프레임 오프셋의 소스 클립을 uv에서 샘플링합니다.
zh_hans: #frames 声明的第 i 个帧偏移处的源片段，在 uv 处采样。

source: How many frames #frames declared.
de: Wie viele Frames #frames deklariert hat.
es: Cuántos fotogramas declaró #frames.
fr: Combien d’images #frames a déclarées.
ja: #frames が宣言したフレーム数です。
ko: #frames가 선언한 프레임 수입니다.
zh_hans: #frames 声明的帧数。

source: The i-th #frames offset, in whole frames.
de: Der i-te #frames-Offset, in ganzen Frames.
es: El i-ésimo desplazamiento de #frames, en fotogramas enteros.
fr: Le i-ème décalage de #frames, en images entières.
ja: i 番目の #frames オフセットを整数フレームで返します。
ko: i번째 #frames 오프셋을 정수 프레임으로 반환합니다.
zh_hans: 第 i 个 #frames 偏移，以整数帧表示。

source: The clip at the first #frames offset. Prefer iNeighborAt.
de: Der Clip beim ersten #frames-Offset. Nutze bevorzugt iNeighborAt.
es: El clip en el primer desplazamiento de #frames. Es preferible iNeighborAt.
fr: Le plan au premier décalage de #frames. Préférez iNeighborAt.
ja: 最初の #frames オフセットのクリップです。iNeighborAt の使用を推奨します。
ko: 첫 번째 #frames 오프셋의 클립입니다. iNeighborAt 사용을 권장합니다.
zh_hans: 第一个 #frames 偏移处的片段。建议改用 iNeighborAt。

source: The clip at the second #frames offset. Prefer iNeighborAt.
de: Der Clip beim zweiten #frames-Offset. Nutze bevorzugt iNeighborAt.
es: El clip en el segundo desplazamiento de #frames. Es preferible iNeighborAt.
fr: Le plan au deuxième décalage de #frames. Préférez iNeighborAt.
ja: 2 番目の #frames オフセットのクリップです。iNeighborAt の使用を推奨します。
ko: 두 번째 #frames 오프셋의 클립입니다. iNeighborAt 사용을 권장합니다.
zh_hans: 第二个 #frames 偏移处的片段。建议改用 iNeighborAt。

source: Set from clip
de: Aus Clip übernehmen
es: Definir desde el clip
fr: Définir depuis le plan
ja: クリップから設定
ko: 클립에서 설정
zh_hans: 从片段取色

source: Click a color in the preview to aim the selected handle at it. The color is read from the original clip, not from the graded result.
de: Klicke in der Vorschau auf eine Farbe, um den ausgewählten Regler darauf auszurichten. Die Farbe wird aus dem Originalclip gelesen, nicht aus dem korrigierten Ergebnis.
es: Haz clic en un color de la previsualización para apuntar hacia él el controlador seleccionado. El color se lee del clip original, no del resultado etalonado.
fr: Cliquez sur une couleur dans l'aperçu pour y pointer la poignée sélectionnée. La couleur est lue dans le plan d'origine, pas dans le résultat étalonné.
ja: プレビューで色をクリックすると、選択中のハンドルがその色に向けられます。色は補正後の結果ではなく、元のクリップから読み取られます。
ko: 미리보기에서 색상을 클릭하면 선택한 핸들이 그 색상을 향합니다. 색상은 보정된 결과가 아니라 원본 클립에서 읽습니다.
zh_hans: 在预览中点按某个颜色，即可让所选控制柄对准该颜色。颜色取自原始片段，而非调色后的结果。
